---
kind: method
id: M:Autodesk.Revit.DB.SKPImportOptions.#ctor(Autodesk.Revit.DB.SKPImportOptions)
source: html/67ce2128-8f9a-0817-b814-04fc3ab50bc0.htm
---
# Autodesk.Revit.DB.SKPImportOptions.#ctor Method

Constructs a new instance of SKPImportOptions as a copy of the import options.

## Syntax (C#)
```csharp
public SKPImportOptions(
	SKPImportOptions option
)
```

## Parameters
- **option** (`Autodesk.Revit.DB.SKPImportOptions`) - The SKP options to be copied.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null